package ru.itis.aisd501.sort.shell_sort;

public class ExampleTest {
    public static void main(String[] args) {
        int[] array = {12, 34, 54, 2, 3, 1, 9};
        ShellSort.shellSort(array);
        for (int x : array) {
            System.out.print(x + " ");
        }
        /*
        Работа алгоритма:

        Шаг 7/2 = 3, сравниваем элементы с индексами 3 и 0, 4 и 1, 5 и 2, 6 и 3
        12 34 54 12 3 1 9 в последнем цикле, 2 34 54 12 3 1 9 после работы последнего цикла, операция m[k] = temp (индексы 3 и 0)
        2 34 54 12 34 1 9 -> 2 3 54 12 34 1 9 (4 и 1)
        2 3 54 12 34 54 9 -> 2 3 1 12 34 54 9 (5 и 2)
        2 3 1 12 34 54 12 -> 2 3 1 9 34 54 12 (6 и 3)

        Шаг 3/2 = 1, сравниваем соседние элементы
        2 3 1 9 34 54 12 ничего не изменилось (1 и 0)
        2 3 3 9 34 54 12 -> 2 2 3 9 34 54 12 -> 1 2 3 9 34 54 12, (2 и 1, 1 и 0)
        1 2 3 9 34 54 12 без изменений (3 и 2)
        1 2 3 9 34 54 12 (4 и 3)
        1 2 3 9 34 54 12 (5 и 4)
        1 2 3 9 34 54 54 -> 1 2 3 9 34 34 54 -> 1 2 3 9 12 34 54 (6 и 5, 5 и 4)

        */
    }
}
